package labs.task1_OOP.utils;

public enum HotelFood {
    OB, //(Only Bed), RO (Room Only) или AO (Accommodation Only) подразумевает размещение в номере отеля без питания.

    BB, //(Bed and Breakfast) означает бесплатное питание только во время завтраков – Континентальный завтрак или Шведский стол.

    HB, // (Half Board) означает полупансион, то есть бесплатное двухразовое питание – завтрак и ужин.

    HB_PLUS, //(Half Board plus) – это расширенный полупансион, с той лишь разницей, что помимо завтрака и ужина в стоимость включены спиртные напитки местного производства.

    FB, // (Full Board) означает полный пансион, включающий в себя завтраки, обеды и ужины.

    FB_PLUS, // (Full Board plus) – то же, что и FB, плюс бесплатные алкогольные напитки в течение всего дня.

    AI, // (All Inclusive) переводится как «Все включено»: завтрак, обед и ужин; различные алкогольные и безалкогольные напитки (обычно местного производства); дополнительное питание (второй завтрак, закуски, полдник).

    UAI // (Ultra All Inclusive) отличается от AI тем, что постояльцам предлагаются не только местные, но и импортные алкогольные и безалкогольные напитки в неограниченном количестве.

}
